This is the `tf apply` output after running the `complete` example on `master` and then on this PR branch:

<details><summary>collapsed</summary>
<p>

```
$ tf apply

...

Terraform will perform the following actions:

  # module.vpc.aws_neptune_subnet_group.neptune[0] will be created
  + resource "aws_neptune_subnet_group" "neptune" {
      + arn         = (known after apply)
      + description = "Neptune subnet group for complete-example"
      + id          = (known after apply)
      + name        = "complete-example"
      + name_prefix = (known after apply)
      + subnet_ids  = (known after apply)
      + tags        = {
          + "Environment" = "staging"
          + "Name"        = "complete"
          + "Owner"       = "user"
        }
      + tags_all    = {
          + "Environment" = "staging"
          + "Name"        = "complete"
          + "Owner"       = "user"
        }
    }

  # module.vpc.aws_route_table_association.neptune[0] will be created
  + resource "aws_route_table_association" "neptune" {
      + id             = (known after apply)
      + route_table_id = "rtb-01b3308216a92ccac"
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.neptune[1] will be created
  + resource "aws_route_table_association" "neptune" {
      + id             = (known after apply)
      + route_table_id = "rtb-01b3308216a92ccac"
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.neptune[2] will be created
  + resource "aws_route_table_association" "neptune" {
      + id             = (known after apply)
      + route_table_id = "rtb-01b3308216a92ccac"
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.neptune[0] will be created
  + resource "aws_subnet" "neptune" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "20.10.61.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Environment" = "staging"
          + "Name"        = "complete"
          + "Owner"       = "user"
        }
      + tags_all                        = {
          + "Environment" = "staging"
          + "Name"        = "complete"
          + "Owner"       = "user"
        }
      + vpc_id                          = "vpc-070f54dfd8cdea070"
    }

  # module.vpc.aws_subnet.neptune[1] will be created
  + resource "aws_subnet" "neptune" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "20.10.62.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Environment" = "staging"
          + "Name"        = "complete"
          + "Owner"       = "user"
        }
      + tags_all                        = {
          + "Environment" = "staging"
          + "Name"        = "complete"
          + "Owner"       = "user"
        }
      + vpc_id                          = "vpc-070f54dfd8cdea070"
    }

  # module.vpc.aws_subnet.neptune[2] will be created
  + resource "aws_subnet" "neptune" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "eu-west-1c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "20.10.63.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Environment" = "staging"
          + "Name"        = "complete"
          + "Owner"       = "user"
        }
      + tags_all                        = {
          + "Environment" = "staging"
          + "Name"        = "complete"
          + "Owner"       = "user"
        }
      + vpc_id                          = "vpc-070f54dfd8cdea070"
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.vpc.aws_subnet.neptune[0]: Creating...
module.vpc.aws_subnet.neptune[2]: Creating...
module.vpc.aws_subnet.neptune[1]: Creating...
module.vpc.aws_subnet.neptune[1]: Creation complete after 2s [id=subnet-0739a3eb000e5363d]
module.vpc.aws_subnet.neptune[2]: Creation complete after 2s [id=subnet-0687f7f9f7bd3a255]
module.vpc.aws_subnet.neptune[0]: Creation complete after 2s [id=subnet-0a84091c24c2acb09]
module.vpc.aws_route_table_association.neptune[2]: Creating...
module.vpc.aws_route_table_association.neptune[1]: Creating...
module.vpc.aws_neptune_subnet_group.neptune[0]: Creating...
module.vpc.aws_route_table_association.neptune[0]: Creating...
module.vpc.aws_route_table_association.neptune[0]: Creation complete after 1s [id=rtbassoc-09172409925237207]
module.vpc.aws_route_table_association.neptune[1]: Creation complete after 1s [id=rtbassoc-00cf803f614b5bd82]
module.vpc.aws_route_table_association.neptune[2]: Creation complete after 1s [id=rtbassoc-08babd4a2ae80de12]
module.vpc.aws_neptune_subnet_group.neptune[0]: Creation complete after 2s [id=complete-example]

Apply complete! Resources: 7 added, 0 changed, 0 destroyed.

Outputs:

...
```

</p>
</details>